[
    {
        "title": "SMASH Hackathon",
        "year": 2025,
        "image": "https://indico.cern.ch/event/1489401/logo-3797433634.png",
        "description": "Utilized the provided LIGO O3 datasets to train models, focusing on detecting unusual patterns in the strain data without relying on pre-defined templates."
    },
    {
        "title": "Spotify Lyrical Landscapes: Mapping Emotional Themes to Music Popularity (2000-2023)",
        "year": 2024,
        "image": "https://play-lh.googleusercontent.com/eN0IexSzxpUDMfFtm-OyM-nNs44Y74Q3k51bxAMhTvrTnuA4OGnTi_fodN4cl-XxDQc",
        "description": "Developed a thematic analysis pipeline to categorize lyrical content based on keyword-based themes and TF-IDF for feature extraction, and presented the findings with visualizations like heatmaps and radar plots to highlight the relationship between lyrical themes and song popularity."
    },
    {
        "title": "Predicting Vermont Business Ratings & Recommending Local Favorites with XGBoost and SVD",
        "year": 2024,
        "image": "https://www.nvidia.com/content/dam/en-zz/Solutions/glossary/data-science/recommendation-system/img-1.png",
        "description": "Built a personalized recommendation system leveraging user-business interactions, location data, and predicted ratings to suggest new businesses based on preferences and proximity."
    },
    {
        "title": "Recipe Calorie Prediction Using Lasso Regression and Feature Engineering",
        "year": 2024,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Developed and tuned a Lasso Regression model (utilizing Scikit-learn pipelines and transformers) for predicting calories of a recipe utilizing feature engineering, achieving a significant improvement in RMSE from 588.5 (linear regression baseline model) to 37.7."
    },
    {
        "title": "Accenture Federal Services: Harnessing AI for the IRS",
        "year": 2024,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Enhanced fraud detection for ERC claims, and implemented an AI-chatbot for taxpayer assistance."
    },
    {
        "title": "Girls Who Code: Interactive Avatar",
        "year": 2024,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Created interactive avatar using p5.js"
    },
    {
        "title": "LLM for Automating i2o Retail Business Reports",
        "year": 2023,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Built LLM models with Hugging Face, OpenAI API, and LangChain to summarize multi-tabbed business reports, streamlining key insights across sales/marketing metrics for clients and reducing manual analysis time."
    },
    {
        "title": "NourishNet: AI-Powered Personalized Nutrition Recommendations",
        "year": 2023,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Created a recommendation system that suggests personalized meal plans based on user preferences, dietary restrictions, and nutrient needs, leveraging NLP on recipe datasets."
    },
    {
        "title": "CrimeMap: Hotspot Prediction for Urban Crime Prevention",
        "year": 2023,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Built a geospatial crime prediction model that identifies high-risk areas using historical crime reports, socio-economic factors, and real-time incident updates."
    },
    {
        "title": "ShopSense: Dynamic Pricing Optimization for E-commerce",
        "year": 2023,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Designed a machine learning model that dynamically adjusts product prices based on competitor pricing, demand trends, and seasonality."
    },
    {
        "title": "HealthTrack: Predicting Hospital Readmission Rates",
        "year": 2022,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Developed a classification model to predict the likelihood of patient readmission within 30 days using electronic health records and socio-economic data."
    },
    {
        "title": "GreenRide: EV Charging Station Demand Forecasting",
        "year": 2021,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Used time-series analysis to predict demand for electric vehicle (EV) charging stations based on weather conditions, traffic density, and location-specific usage data."
    }
]